{
  "qa": {
    "urlKey": "qa",
    "videoUrl": "https://www.youtube.com/embed/AYjmP9lNq2Y",
    "title": "מסלול QA",
    "brief": "אנשי ה-QA משתתפים בתהליך הפיתוח של המערכות המבצעיות התורמות לעליונות הטכנולוגית של צהל עליהם להישאר מעודכנים בטכנולוגיות המתקדמות ביותר ובדרכים שונות לוידוא איכות התוכנות אותן הם בודקים.",
    "aboutRole": [
      {
        "text": "איש הQA אחראי על מתן אישור אחרון לפני שמערכת תוכנה עולה לשימוש ועל וידוא האיכות ומניעת תקלות לאורך כל תהליכי פיתוח המערכות בצהל.",
        "id": 0
      },
      {
        "text": "אנשי הQA משתתפים בתהליך הפיתוח של המערכות המבצעיות התורמות לעליונות הטכנולוגית של צהל עליהם להישאר מעודכנים בטכנולוגיות  המתקדמות ביותר ובדרכים שונות לוידוא איכות התוכנות אותן הם בודקים.",
        "id": 1
      },
      {
        "text": "בקורס לומדים על תהליך הבדיקות, וידוא האיכות של מערכות, עבודת צוות ותפקוד תחת לחץ.",
        "id": 2
      },
      {
        "text": "את הבדיקות מבצעים בצורה ידנית או אוטומטית (בקוד). בקורס לומדים לפתח בדיקות אוטומטית בקוד בשפת Java, ובעזרת כלים אוטומטיים שונים אחרים.",
        "id": 3
      },
      {
        "text": "עבודת איש הQA דורשת חשיבה מחוץ לקופסה, יצירתיות וביקורתיות בכדי לוודא שכמות התקלות במערכות היא מינימאלית ולהימנע מכשלים טכנולוגים מסכני חיי אדם.",
        "id": 4
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 1
      },
      {
        "header": "איפה משרתים?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 2
      }
    ]
  },
  "programming": {
    "urlKey": "programming",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול תכנות",
    "brief": "קורס תכנות מכשיר מפתחי תוכנה ואפליקציה אשר מפתחים מערכות לחימה ומערכות תומכות לחימה לכלל זרועות הצבא.",
    "aboutRole": [
      {
        "text": "העבודה כתוכניתן דורשת חשיבה לוגית ואלגוריתמית, עבודת צוות ומלווה באתגרים רבים. העבודה כתוכניתנים דורשת למידת נושאים וטכנולוגיות חדשות.",
        "id": 0
      },
      {
        "text": "צורת העבודה של צוותי התוכניתנים דומה לעבודה בחברות פיתוח תוכנה באזרחות",
        "id": 1
      },
      {
        "text": "במהלך המסלול יש אפשרות לשילוב לימודים אקדמאיים והקורס מקנה נקודות זכות",
        "id": 2
      },
      {
        "text": "תוכניתנים יוצאים עם מקצוע ונסיון לאזרחות",
        "id": 3
      },
      {
        "text": "בקורס לומדים אלגוריתמיקה, פיתוח צד שרת, צד לקוח, data base, עקרונות oop, DevOps ו ux ",
        "id": 4
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 1
      },
      {
        "header": "איפה משרתים?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 2
      }
    ]
  },
  "mapal": {
    "urlKey": "mapal",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול מפתח לומדה",
    "brief": "מפתח הלומדה משובץ ביחידות פיתוח הדרכה בכלל הזרועות בצה\"ל, ואחראי על פיתוח תוצרי הדרכה מתוקשבים.",
    "aboutRole": [
      {
        "text": "לומדות, אתרי אינטרנט, משחקים וסימולטורים הם רק חלק מהתוצרים המאפשרים העברת חומר, הקניית ידע ומיומנויות למשתמשים בצורה חוויתית ואינטראקטיבית.",
        "id": 0
      },
      {
        "text": "העבודה כמפתח לומדה דורשת חשיבה לוגית, יצירתיות, חשיבה מחוץ לקופסא ויכולות למידה עצמית.",
        "id": 1
      },
      {
        "text": "בקורס מתמקדים בארבעה עולמות תוכן עיקריים: תכנות, פיתוח הדרכה, עבודה מול לקוח וגרפיקות.",
        "id": 2
      },
      {
        "text": "הקורס לא דורש ידע מקדים, ומלמד את כלל הכלים הדרושים ליצירת תוצר הדרכה מתוקשב.",
        "id": 3
      },
      {
        "text": "הטכנולוגיה משתנה ומתפתחת בקצב מהיר ומפתחי הלומדה ישפיעו על התאמת הלמידה המתוקשבת לעידן החדש.",
        "id": 4
      },
      {
        "text": "כיום, התוצרים המתוקשבים של מפתחי הלומדה מפותחים במספר פלטפורמות מרכזיות:",
        "id": 5
      },
      {
        "text": "פיתוח ב ווב  עם HTML, CSS וJAVA SCRIPT , שהן השפות המרכיבות כל אתר אינטרנט.",
        "id": 6
      },
      {
        "text": "תוצרים של המנוע הגרפי unity המאפשר לפתח משחקים בדו ותלת מימד ",
        "id": 7
      },
      {
        "text": "ותוצרים של תוכנת ההנפשה animate המייצרת אנימציות אינטראקטיביות.",
        "id": 8
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 1
      },
      {
        "header": "איפה משרתים?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 2
      }
    ]
  },
  "devops": {
    "urlKey": "devops",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול DevOps",
    "brief": "אנשי DevOps מחברים בין האנשים שבונים את המערכות לבין האנשים שאחראים על התשתית. זאת באמצעות שילוב של כלים אוטומטיים, ותשתית מחשוב גמישה.",
    "aboutRole": [
      {
        "text": "DevOps הינו חיבור של המילים Developer (מפתח)-ו Operations (תפעול).",
        "id": 0
      },
      {
        "text": "דבאופס היא תרבות שמאפשרת לצוותים לעבוד ביחד על תכנון, פיתוח, הפצה של מערכות ותפעול. זאת באמצעות שילוב של כלים אוטומטיים, ותשתית מחשוב גמישה.",
        "id": 1
      },
      {
        "text": "אנשי DevOps מחברים בין האנשים שבונים את המערכות לבין האנשים שאחראים על התשתית.",
        "id": 2
      },
      {
        "text": "בתפקיד מתחזקים ומפתחים תשתיות של מערכות קריטיות לתפקוד צה\"ל.",
        "id": 3
      },
      {
        "text": "בקורס לומדים על עולם המחשבים הבסיסי כגון רשתות, מערכות הפעלה, תכנות ברמה בסיסית ועד עולם המחשבים הקדמתי כגון וירטואליזציה, ענן, קונטיינרים, ו-DevOps.",
        "id": 4
      },
      {
        "text": "הקורס והתפקיד מלמדים כיצד ללמוד טכנולוגיות חדשות בעולם המחשבים שמתחדש כל הזמן, ומקנה כלים רבים לעולם ההייטק באזרחות.",
        "id": 5
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 1
      },
      {
        "header": "איפה משרתים?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 2
      }
    ]
  },
  "magen-cyber": {
    "urlKey": "magen-cyber",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מגן סייבר",
    "brief": "מגן בסייבר הוא תפקיד בצה\"ל שמטרתו להכיר את רשתות צה\"ל ולהכן עליהן מפני כל חדירה. ",
    "aboutRole": [
      {
        "text": "בקורס מתחילים בלהיחשף לתוך עולם המחשבים, איך מחשב עובד, כיצד לתכנת באופן בסיסי, איך נראית רשת מחשבים ומבו במבנה הארגוני של רשתות בצה\"ל",
        "id": 0
      },
      {
        "text": "בנוסף, לומדים תכנים שמטרתם לקבל צורת חשיבה אבטחתית - חקירת אירועי תקיפה וזיהוי פערי אבטה ברשת, עקרונות תקיפה מגוונים, התנסות התנסות בתרחישים של תקיפת אמת ועוד מגוון תכנים שיעזרו להבין לעומק את מערכת ההפעלה.",
        "id": 1
      },
      {
        "text": "את השירות בתפקיד ניתן לחלק ל2 קטגוריות עיקריות: \n 1. הגנה לשם הגנה, כלומר, מגנים על הרשתות של צה\"ל מפני תקיפת אויב. \n 2. תקיפה לשם הגנה, כלומר, ניסיון לדמות תקיפה על רשתות צה\"ל, שמטרתו ללמוד על החולשות של הרשת והמחשבים הצה\"ליים ובכך לשפר את ההגנה עליהם.",
        "id": 2
      },
      {
        "text": "תפקיד ההגנה דורש יצירתיות וחשיבה מחוץ לקופסה, אחריות ויכולת למידה עצמית. המגנים שנמצאים בהכשרה מפתחים יכולות אלה במהלך הקורס והתפקיד.",
        "id": 3
      },
      {
        "text": "השירות בתור מגן בסייבר הוא שירות משמעותי שתורם לידע המקצועי של המגן ומספק כלים רבים שניתן להשתמש בהם גם באזרחות.",
        "id": 4
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 1
      },
      {
        "header": "איפה משרתים?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 2
      }
    ]
  },
  "sre": {
    "urlKey": "sre",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "sre",
    "brief": "בעולם שבו מערכות מידע הפכו לחלק אינטגרלי בכל היבט בחיינו, כל שניה היא קריטית ובצה\"ל בפרט. פיתוח מערכות המידע בצה\"ל מציל חיים. המערכות עוטפות את כלל ההיבטים בצהל - החל מיכולות הארגון (כגון לוגיסטיקה ורפואה) עד לכדי סיכול אירועים בטחוניים.",
    "aboutRole": [
      {
        "text": "שנם מקרים שבהם המערכות לא פועלות כראוי, למשל תחת עומס. כתוצאה מכך נגרם נזק ממשי לתפקוד מערכות צה\"ל השונות וכתוצאה, חיי אדם עלולים להיפגע.",
        "id": 0
      },
      {
        "text": "בכדי להימנע ממצבים אלו וכדי לצמצם זמני השבתה, לשפר את ביצועי המערכות בעומסים, ולשפר את הזמינות והשרידות של המערכות, קיים בצבא תפקיד הSRE.",
        "id": 1
      },
      {
        "text": "SRE , ראשי תיבות של Site Reliability Engineering, הוא תפקיד האחראי על שימור יכולות המערכות בצה\"ל.",
        "id": 2
      },
      {
        "text": "בין הכלים העומדים לרשותנו: כלים לניטור האפליקציות ויעילות שימוש האפליקציה בתשתית, זמני תגובה, כלים לבדיקת עומסים, ומוצרים תשתיתיים שונים עליהם תלמדו בקורס ועוד.",
        "id": 3
      },
      {
        "text": "עוד היבט חשוב בתפקיד הוא תחקור תקלות והצבת סטנדרט עבודה אחיד ויעיל הן מבחינת שימוש בתשתית והן בהיבט הפיתוחי.",
        "id": 4
      },
      {
        "text": "העבודה כSRE דורשת שאיפה לחדשנות, חשיבה מחוץ לקופסה, תשוקה טכנולוגית, יכולת למידה עצמית, עבודה עם אנשים ועמידה מול קהל.",
        "id": 5
      },
      {
        "text": "בקורס מתמקצעים בעבודה עם מערכות הפעלה, תכנות בסיסי עם JavaScript, הכרת עולם הפיתוח הwebי, עבודה עם מסדי נתונים, סביבות קונטיינרים, כלים להעלאת גרסאות למערכות השונות בצורה מהירה, כלי ניטור ועוד..",
        "id": 6
      },
      {
        "text": "הקורס והתפקיד יקנו לכם את דרכי החשיבה והכלים המקצועיים והבין אישיים שנדרשים למקצוע זה, הן בצבא והן באזרחות.",
        "id": 7
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 1
      },
      {
        "header": "איפה משרתים?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 2
      }
    ]
  },
  "dataAnalyst": {
    "urlKey": "data-analyst",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול Data Analyst",
    "brief": "מטרת הData Analyst  היא לסייע למפקדים בצה״ל לקבל החלטות מבוססות מידע.",
    "aboutRole": [
      {
        "text": "איך הם עושים את זה?",
        "id": 0
      },
      {
        "text": "אוספים, מעבדים, חוקרים ומנתחים נתונים ממערכות צה״ל ומנגישים את המידע למקבלי ההחלטות על ידי הצגת מסקנות ממחקרים ופיתוח מערכות BI תומכות החלטה.",
        "id": 1
      },
      {
        "text": "צה״ל שואף להיות ארגון Data Driven כלומר ארגון שכלל ההחלטות והתהליכים בו מתבססים על מידע. תפקיד האנליסט הוא להוות גשר בין המידע והטכנולוגיה לקצה המבצעי ומקבלי החלטות.",
        "id": 2
      },
      {
        "text": "העבודה כData Analyst  דורשת אסרטיביות, חשיבה אנליטית, יכולת למידה עצמאית, עבודה עם אנשים ועמידה מול קהל",
        "id": 3
      },
      {
        "text": "בקורס מתמקצעים בעבודה עם לקוחות ויכולות פרזנטציה, איסוף ועיבוד מידע בעזרת סקריפטים, ניתוח והצגת המידע על ידי טכניקות סטטיסטיות וכלי  BI.",
        "id": 4
      },
      {
        "text": "בקורס לומדים כלים בסיסיים לData Analyst  כמו עבודה עם מסדי נתונים, python סטטיסטיקה ועוד.",
        "id": 5
      },
      {
        "text": "מכיוון שאנו בעיצומה של מהפכת המידע תפקיד ה Data Analyst מבוקש מאוד בתעשייה האזרחית.",
        "id": 6
      },
      {
        "text": "בקורס לומדים כלים בסיסיים לData Analyst  כמו עבודה עם מסדי נתונים, python סטטיסטיקה ועוד.",
        "id": 7
      },
      {
        "text": "חברה שרוצה להיות רלוונטית נדרשת שיהיו לה תהליכי מיצוי מידע וData Analysts.",
        "id": 8
      },
      {
        "text": "הקורס והתפקיד יקנו לכם את דרכי החשיבה והכלים המקצועיים והבין אישיים שנדרשים למקצוע זה.",
        "id": 9
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 1
      },
      {
        "header": "איפה משרתים?",
        "extraInfo": ["דפ\"ר: להוסיף", "קב\"א: להוסיף"],
        "id": 2
      }
    ]
  }
}
