{
  "qa": {
    "urlKey": "qa",
    "videoUrl": "https://www.youtube.com/embed/AYjmP9lNq2Y",
    "title": "מסלול QA",
    "brief": "אנשי ה-QA אחראיים על הבטחת האיכות של המערכות השונות בצה״ל, הכלליות והמבצעיות על מנת להבטיח שכל תהליכי הצבא עובדים בצורה האיכותית והטובה ביותר ובכך לתרום לעליונות הטכנולוגית של צהל. עליהם להישאר מעודכנים בטכנולוגיות המתקדמות ביותר ובדרכים שונות לוידוא איכות ואמינות התוכנות אותן הם בודקים.",
    "aboutRole": [
      {
        "text": "אנשי ה-QA משתלבים בכל יחידות התוכנה של צה״ל, ומהווים חלק אינטגרלי מצוותי פיתוח התוכנה, במטרה לוודא את איכות המערכת המפותחת, ובכך להוציא מערכות תקינות ואיכותיות, ללא תקלות לשימוש הצבא במטה ובשטח.",
        "id": 0
      },
      {
        "text": "איש הQA אחראי על מתן אישור אחרון לפני שמערכת תוכנה עולה לשימוש ועל וידוא האיכות ומניעת תקלות לאורך כל תהליכי פיתוח המערכות בצה\"ל.",
        "id": 1
      },
      {
        "text": "את הבדיקות מבצעים בצורה ידנית או אוטומטית (בקוד). בקורס לומדים לתכנן בדיקות ולפתח בדיקות אוטומטית (תשתיות אוטומציה) ובעזרת כלים אוטומטיים שונים אחרים.",
        "id": 2
      },
      {
        "text": "עבודת איש הQA דורשת חשיבה מחוץ לקופסה, יצירתיות וביקורתיות כדי לזהות את נקודות התורפה של המערכת ובכך למנוע תקלות עתידיות ולמצוא תקלות קיימות לפני מבצוע.",
        "id": 3
      },
      {
        "text": "מיומנויות נדרשות: עבודה בצוות, עצמאות ויכולות למידה עצמית, סקרנות טכנולוגית, תפקוד תחת לחץ וחשיבה ביקורתית ויצירתית.",
        "id": 4
      },
      {
        "text": "בין התכנים הנלמדים בקורס: הנדסת בדיקות תוכנה, כלים לניהול וכתיבת תסריטי בדיקה כמו AzureDevOps, פיתוח תשתיות אוטומציה (POM) בשפת Java עם טכנולוגיית Selenium, עבודה מול מסדי נתונים, עבודה עם GIT, היכרות עם תהליכי CI/CD",
        "id": 5
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": [
          "דפ\"ר 60 ומעלה",
          "פרופיל 25 ומעלה.",
          "בנות מחויבות לשירות חובה של 32 חודשים.",
          "ציוני  מא\"ה: ניהול וארגון 2 ומעלה, עיבוד מידע 3 ומעלה."
        ],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": [
          "טירונות 02.",
          "הכשרה שאורכה כ-11 שבועות.",
          "השיבוץ הינו בכלל יחידות התוכנה הנמצאות בכל הזרועות בצה\"ל."
        ],
        "id": 1
      },
      {
        "header": "מיקום",
        "extraInfo": ["בסמח באר שבע, בניין גב ים 4."],
        "id": 2
      }
    ]
  },
  "programming": {
    "urlKey": "programming",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול תכנות",
    "brief": "קורס תכנות מכשיר מפתחי תוכנה ואפליקציה אשר מפתחים מערכות לחימה ומערכות תומכות לחימה לכלל זרועות הצבא.",
    "aboutRole": [
      {
        "text": "העבודה כתוכניתן דורשת חשיבה לוגית ואלגוריתמית, עבודת צוות ומלווה באתגרים רבים. העבודה כתוכניתנים דורשת למידת נושאים וטכנולוגיות חדשות.",
        "id": 0
      },
      {
        "text": "צורת העבודה של צוותי התוכניתנים דומה לעבודה בחברות פיתוח תוכנה באזרחות",
        "id": 1
      },
      {
        "text": "במהלך המסלול יש אפשרות לשילוב לימודים אקדמאיים והקורס מקנה נקודות זכות",
        "id": 2
      },
      {
        "text": "תוכניתנים יוצאים עם מקצוע ונסיון לאזרחות",
        "id": 3
      },
      {
        "text": "בקורס לומדים אלגוריתמיקה, פיתוח צד שרת, צד לקוח, data base, עקרונות oop, DevOps ו ux ",
        "id": 4
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": [
          "דפ\"ר 70 ומעלה.",
          "הקורס לא מחייב ידע מוקדם במחשבים אלא מתבסס על חשיבה לוגית.",
          "פרופיל 25 ומעלה.",
          "ציוני  מא\"ה: ניהול וארגון 2 ומעלה, עיבוד מידע 3 ומעלה.",
          "בנות נדרשות לאורך שירות חובה של 32 חודשים. בנוסף נדרש שירות קבע של שנתיים וחצי בתום שירות החובה."
        ],

        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": [
          "הכשרה קדם צבאית של 25 שבועות. למאותרי עתודה טכנולוגית - לימודי כיתה י\"ג - ולאחריהם הכשרה הנמשכת כ- 3 חודשים",
          "טירונות 02.",
          "שיבוצי הקורס הם בחיל הקשר והתקשוב וכלל הזרועות בצה\"ל."
        ],
        "id": 1
      },
      {
        "header": "מיקום",
        "extraInfo": ["בסמח באר שבע, בניין גב ים 4."],
        "id": 2
      }
    ]
  },
  "mapal": {
    "urlKey": "mapal",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול מפתח לומדה",
    "brief": "מפתח הלומדה משובץ ביחידות פיתוח הדרכה בכלל הזרועות בצה\"ל, ואחראי על פיתוח תוצרי הדרכה מתוקשבים.",
    "aboutRole": [
      {
        "text": "לומדות, אתרי אינטרנט, משחקים וסימולטורים הם רק חלק מהתוצרים המאפשרים העברת חומר, הקניית ידע ומיומנויות למשתמשים בצורה חוויתית ואינטראקטיבית.",
        "id": 0
      },
      {
        "text": "העבודה כמפתח לומדה דורשת חשיבה לוגית, יצירתיות, חשיבה מחוץ לקופסא ויכולות למידה עצמית.",
        "id": 1
      },
      {
        "text": "בקורס מתמקדים בארבעה עולמות תוכן עיקריים: תכנות, פיתוח הדרכה, עבודה מול לקוח וגרפיקות.",
        "id": 2
      },
      {
        "text": "הקורס לא דורש ידע מקדים, ומלמד את כלל הכלים הדרושים ליצירת תוצר הדרכה מתוקשב.",
        "id": 3
      },
      {
        "text": "הטכנולוגיה משתנה ומתפתחת בקצב מהיר ומפתחי הלומדה ישפיעו על התאמת הלמידה המתוקשבת לעידן החדש.",
        "id": 4
      },
      {
        "text": "כיום, התוצרים המתוקשבים של מפתחי הלומדה מפותחים במספר פלטפורמות מרכזיות:",
        "id": 5
      },
      {
        "text": "פיתוח ב ווב  עם HTML, CSS וJAVA SCRIPT , שהן השפות המרכיבות כל אתר אינטרנט.",
        "id": 6
      },
      {
        "text": "תוצרים של המנוע הגרפי unity המאפשר לפתח משחקים בדו ותלת מימד ",
        "id": 7
      },
      {
        "text": "ותוצרים של תוכנת ההנפשה animate המייצרת אנימציות אינטראקטיביות.",
        "id": 8
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": [
          "דפ\"ר 60 ומעלה.",
          "לא נדרש ידע מקדים.",
          "פרופיל 45 ומעלה.",
          "ציוני  מא\"ה: ניהול וארגון 2 ומעלה, עיבוד מידע 3 ומעלה."
        ],

        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": [
          "טירונות 02.",
          "הכשרה שאורכה כחודשיים.",
          "אורך השירות הינו 32 חודשים לבנים ו24 חודשים לבנות.",
          "בסיום הקורס ניתן להשתבץ בתפקיד במגוון של יחידות בכל רחבי הארץ (בבסיסים פתוחים וסגורים) בזרועות השונות."
        ],
        "id": 1
      },
      {
        "header": "מיקום",
        "extraInfo": ["בסמח באר שבע, בניין גב ים 4."],
        "id": 2
      }
    ]
  },
  "devops": {
    "urlKey": "devops",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול DevOps",
    "brief": "אנשי DevOps מחברים בין האנשים שבונים את המערכות לבין האנשים שאחראים על התשתית. זאת באמצעות שילוב של כלים אוטומטיים, ותשתית מחשוב גמישה.",
    "aboutRole": [
      {
        "text": "DevOps הינו חיבור של המילים Developer (מפתח)-ו Operations (תפעול).",
        "id": 0
      },
      {
        "text": "דבאופס היא תרבות שמאפשרת לצוותים לעבוד ביחד על תכנון, פיתוח, הפצה של מערכות ותפעול. זאת באמצעות שילוב של כלים אוטומטיים, ותשתית מחשוב גמישה.",
        "id": 1
      },
      {
        "text": "אנשי DevOps מחברים בין האנשים שבונים את המערכות לבין האנשים שאחראים על התשתית.",
        "id": 2
      },
      {
        "text": "בתפקיד מתחזקים ומפתחים תשתיות של מערכות קריטיות לתפקוד צה\"ל.",
        "id": 3
      },
      {
        "text": "בקורס לומדים על עולם המחשבים הבסיסי כגון רשתות, מערכות הפעלה, תכנות ברמה בסיסית ועד עולם המחשבים הקדמתי כגון וירטואליזציה, ענן, קונטיינרים, ו-DevOps.",
        "id": 4
      },
      {
        "text": "הקורס והתפקיד מלמדים כיצד ללמוד טכנולוגיות חדשות בעולם המחשבים שמתחדש כל הזמן, ומקנה כלים רבים לעולם ההייטק באזרחות.",
        "id": 5
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": [
          "דפ\"ר 70 ומעלה.",
          "לבנות אין הגבלת פרופיל, התפקיד פתוח לבנים בעלי פרופיל עורפי בלבד.",
          "התפקיד דורש חתימת קבע של כשנה מתום שירות החובה לבנים, בנות נדרשות לאורך שירות זהה לשל גברים על פי חוק (32 חודשים)",
          "ציוני  מא\"ה: ניהול וארגון 2 ומעלה, עיבוד מידע 3 ומעלה."
        ],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": [
          "הכשרה קדם צבאית שאורכה כ-19 שבועות.",
          "טירונות 02.",
          "שיבוץ במרכזי המחשוב ביחידות חיל הקשר והתקשוב, ביניהן ממר\"ם ובכלל הזרועות בצה\"ל."
        ],
        "id": 1
      },
      {
        "header": "מיקום",
        "extraInfo": ["בסמח באר שבע, בניין גב ים 4."],
        "id": 2
      }
    ]
  },
  "magen-cyber": {
    "urlKey": "magen-cyber",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מגן סייבר",
    "brief": "מגן בסייבר הוא תפקיד בצה\"ל שמטרתו להכיר את רשתות צה\"ל ולהגן עליהן מפני כל חדירה. ",
    "aboutRole": [
      {
        "text": "בקורס מתחילים בלהיחשף לתוך עולם המחשבים, איך מחשב עובד, כיצד לתכנת באופן בסיסי, איך נראית רשת מחשבים ומהו במבנה הארגוני של רשתות בצה\"ל",
        "id": 0
      },
      {
        "text": "בנוסף, לומדים תכנים שמטרתם לקבל צורת חשיבה אבטחתית - חקירת אירועי תקיפה וזיהוי פערי אבטה ברשת, עקרונות תקיפה מגוונים, התנסות התנסות בתרחישים של תקיפת אמת ועוד מגוון תכנים שיעזרו להבין לעומק את מערכת ההפעלה.",
        "id": 1
      },
      {
        "text": "את השירות בתפקיד ניתן לחלק ל2 קטגוריות עיקריות: \n 1. הגנה לשם הגנה, כלומר, מגנים על הרשתות של צה\"ל מפני תקיפת אויב. \n 2. תקיפה לשם הגנה, כלומר, ניסיון לדמות תקיפה על רשתות צה\"ל, שמטרתו ללמוד על החולשות של הרשת והמחשבים הצה\"ליים ובכך לשפר את ההגנה עליהם.",
        "id": 2
      },
      {
        "text": "תפקיד ההגנה דורש יצירתיות וחשיבה מחוץ לקופסה, אחריות ויכולת למידה עצמית. המגנים שנמצאים בהכשרה מפתחים יכולות אלה במהלך הקורס והתפקיד.",
        "id": 3
      },
      {
        "text": "השירות בתור מגן בסייבר הוא שירות משמעותי שתורם לידע המקצועי של המגן ומספק כלים רבים שניתן להשתמש בהם גם באזרחות.",
        "id": 4
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": [
          "דפ\"ר 70 ומעלה.",
          "לא נדרש ידע מקדים",
          "בנות מחויבות לשירות חובה של 32 חודשים.",
          "בנוסף התפקיד כרוך בחתימה של שנתיים קבע.",
          "ציוני  מא\"ה: ניהול וארגון 2 ומעלה, עיבוד מידע 3 ומעלה."
        ],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": [
          "טירונות 02.",
          "הכשרה שאורכה כ-19 שבועות.",
          "בסיום הקורס משובצים בצוותים בזרועות השונות בצה\"ל."
        ],
        "id": 1
      },
      {
        "header": "מיקום",
        "extraInfo": ["בסמח באר שבע, בניין גב ים 4."],
        "id": 2
      }
    ]
  },
  "DC": {
    "urlKey": "DC",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מנהל DC",
    "brief": "תהיתם פעם איך עולם המחשבים עובד? כמו כמעט כל דבר טכנולוגי שהשימוש בו כל כך טריוויאלי לנו כמו סתם לגלוש באינטנרט? איפה כל הדברים שמאפשרים לנו את כל הדברים האלה נמצאים בכלל?  \n התשובה היא בחוות השרתים או בקיצור dc.",
    "aboutRole": [
      {
        "text": "מנהל הdc אחראי על תפעול התקנה ואחזקת הDC וניהולו בשוטף.",
        "id": 0
      },
      {
        "text": "המערכות אותן אנו מנהלים משמשות למגוון מטרות ועונות על צרכים מבצעיים שונים. מארגון לוגיסטי וכוח אדם, ועד למערכות מבצעיות המשמשות את החיילים בשטח.",
        "id": 1
      },
      {
        "text": "בקורס לומדים על עולם התשתיות, חומרת השרתים, ניהול מערכות הפעלה שונות לעומק, רשתות ועד עולם הוירטואליזציה.",
        "id": 2
      },
      {
        "text": "בסוף הקורס החיילים משתבצים בכל הזרועות בצה״ל מודיעין תקשוב חיל הים וחיל האוויר ובפיקודים השונים.",
        "id": 3
      },
      {
        "text": "תפקיד מנהל dc הוא תפקיד טכנולוגי ומבצעי הדורש חשיבה מחוץ לקופסה, יצירתיות עבודת צוות, איתנות, חריצות, התפקיד מלווה בלמידה עצמית ועבודה עם טכנולוגיות שונות.",
        "id": 4
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": ["דפ\"ר 60 ומעלה.", "לא נדרש ידע מקדים"],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": [
          "טירונות 02.",
          "הכשרה שאורכה כ-10 שבועות.",
          "שיבוץ במרכזי המחשוב ביחידות חיל הקשר והתקשוב, ביניהן ממר\"ם ובכלל הזרועות בצה\"ל."
        ],
        "id": 1
      },
      {
        "header": "מיקום",
        "extraInfo": ["בסמח באר שבע, בניין גב ים 4."],
        "id": 2
      }
    ]
  },
  "sre": {
    "urlKey": "sre",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול SRE",
    "brief": "בעולם שבו מערכות מידע הפכו לחלק אינטגרלי בכל היבט בחיינו, כל שניה היא קריטית ובצה\"ל בפרט. פיתוח מערכות המידע בצה\"ל מציל חיים. המערכות עוטפות את כלל ההיבטים בצהל - החל מיכולות הארגון (כגון לוגיסטיקה ורפואה) עד לכדי סיכול אירועים בטחוניים.",
    "aboutRole": [
      {
        "text": "ישנם מקרים שבהם המערכות לא פועלות כראוי, למשל תחת עומס. כתוצאה מכך נגרם נזק ממשי לתפקוד מערכות צה\"ל השונות וכתוצאה, חיי אדם עלולים להיפגע.",
        "id": 0
      },
      {
        "text": "בכדי להימנע ממצבים אלו וכדי לצמצם זמני השבתה, לשפר את ביצועי המערכות בעומסים, ולשפר את הזמינות והשרידות של המערכות, קיים בצבא תפקיד הSRE.",
        "id": 1
      },
      {
        "text": "SRE , ראשי תיבות של Site Reliability Engineering, הוא תפקיד האחראי על שימור יכולות המערכות בצה\"ל.",
        "id": 2
      },
      {
        "text": "בין הכלים העומדים לרשותינו: כלים לניטור האפליקציות ויעילות שימוש האפליקציה בתשתית, זמני תגובה, כלים לבדיקת עומסים, ומוצרים תשתיתיים שונים עליהם תלמדו בקורס ועוד.",
        "id": 3
      },
      {
        "text": "עוד היבט חשוב בתפקיד הוא תחקור תקלות והצבת סטנדרט עבודה אחיד ויעיל הן מבחינת שימוש בתשתית והן בהיבט הפיתוחי.",
        "id": 4
      },
      {
        "text": "העבודה כSRE דורשת שאיפה לחדשנות, חשיבה מחוץ לקופסה, תשוקה טכנולוגית, יכולת למידה עצמית, עבודה עם אנשים ועמידה מול קהל.",
        "id": 5
      },
      {
        "text": "בקורס מתמקצעים בעבודה עם מערכות הפעלה, תכנות בסיסי עם JavaScript, הכרת עולם הפיתוח הwebי, עבודה עם מסדי נתונים, סביבות קונטיינרים, כלים להעלאת גרסאות למערכות השונות בצורה מהירה, כלי ניטור ועוד..",
        "id": 6
      },
      {
        "text": "הקורס והתפקיד יקנו לכם את דרכי החשיבה והכלים המקצועיים והבין אישיים שנדרשים למקצוע זה, הן בצבא והן באזרחות.",
        "id": 7
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",

        "id": 0
      },
      {
        "header": "מה במסלול?",

        "id": 1
      },
      {
        "header": "מיקום",
        "extraInfo": ["בסמח באר שבע, בניין גב ים 4."],
        "id": 2
      }
    ]
  },
  "erp": {
    "urlKey": "erp",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול erp",
    "brief": "תפיסת ה ERP היא לאחד את כל התהליכים השונים בארגון (גיוס עובדים, הזמנת פריטים, ניהול כספים וכו) לתוך מערכת אחת.",
    "aboutRole": [
      {
        "text": "בפועל המיישם יהיה אחראי על אפיון תפיסת פיתרון לתהליכים השונים בצהל, יישום טכני של התהליכים האלו במערכת המידע המרכזית של צהל, מערכת הSAP. בנוסף המיישם אחראי על התחזוקה השוטפת ותפעול המערכת ברמה היום יומית.",
        "id": 0
      },
      {
        "text": "למערכת המידע שהמיישם אחראי עליה, עשרות ואף מאות אלפי משתמשים, המשתמשים במערכת בתדירות יום יומית לביצוע פעולות חיוניות להצלחתו של צהל כארגון מגיוס החיילים ועד אספקת נשק לכוחות בשטח. למיישם יש אחריות רבה והשפעה ניכרת על שיפור וייעול התהליכים בצהל.",
        "id": 1
      },
      {
        "text": "בקורס לומדים איך לוקחים דרישה מבצעית, מיישמים אותה, והופכים אותה למערכת קריטית לתפקוד כלל הזרועות בצהל.",
        "id": 2
      },
      {
        "text": "בנוסף, לומדים בקורס את תחום ניהול המוצר, עבודה על פרויקטים ועבודה בצוות. כל הדברים האלו הם חלק בלתי נפרד מהעבודה השוטפת בתפקיד.",
        "id": 3
      },
      {
        "text": "לומדים איך לעבוד עם לקוחות, לשאול אותם את השאלות הנכונות ואיך לענות על הצרכים שלהם.",
        "id": 4
      },
      {
        "text": "בנוסף, לומדים בקורס את תחום ניהול המוצר, עבודה על פרויקטים ועבודה בצוות.",
        "id": 5
      },
      {
        "text": "כל הדברים האלו הם חלק בלתי נפרד מהעבודה השוטפת בתפקיד.",
        "id": 6
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": ["בוגרי כיתה י\"ג בהנדסת תוכנה"],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": [
          "טירונות 02",
          "הכשרה באורך כ-8 שבועות",
          "שירות בבסיס צריפין, השירות כולל יציאה להדרכות בבסיסים שונים ברחבי הארץ"
        ],
        "id": 1
      },
      {
        "header": "מיקום",
        "extraInfo": ["בסמח באר שבע, בניין גב ים 4."],
        "id": 2
      }
    ]
  },
  "dataAnalyst": {
    "urlKey": "data-analyst",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול Data Analyst",
    "brief": "הData Analyst אחראי לעבד ולחקור את מקורות המידע של צה\"ל על מנת לייצר אנליצות מתקדמות ומערכות BI ולסייע למפקדים בצה״ל לקבל החלטות מבוססות מידע.",
    "aboutRole": [
      {
        "text": "העבודה כData Analyst דורשת חשיבה אנליטית, יכולת פתרון בעיות, אסרטיביות, יכולת למידה עצמאית, עבודה עם אנשים ויכולות פרזנטציה.",
        "id": 0
      },
      {
        "text": "עבודת הData Analyst מלווה באתגרים רבים. הData Analyst הינו תפקיד בעל השפעה המהווה גשר בין הקצה הטכנולוגי למבצעי.",
        "id": 1
      },
      {
        "text": "בקורס נחשפים לעולם הData Science, התפקידים השונים בו, תהליכי מיצוי מידע ומתמקצעים בעבודה עם לקוחות, פרזנטציה, איסוף ועיבוד מידע, ניתוח והצגת מידע על ידי טכניקות סטטיסטיות, שפות תכנות וכלי BI.",
        "id": 2
      },
      {
        "text": "בקורס לומדים את כלים לData Analyst כמו עבודה עם מסדי נתונים, Python וסטטיסטיקה. הקורס אינו דורש ידע מקדים ומלמד את המקצוע מ-0.",
        "id": 3
      },
      {
        "text": "אנליסטים יוצאים עם מקצוע וניסיון לאזרחות.",
        "id": 4
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": [
          "דפ\"ר 60 ומעלה.",
          "הארכת שירות ל32 חודשים לנשים (דין אישה כדין גבר).",
          "אין צורך בידע מקדים."
        ],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": [
          "טירונות 02.",
          "הכשרה שאורכה כ-15 שבועות.",
          "בסיום הקורס משובצים בבתי התוכנה במרכז הארץ ובפיקודים השונים."
        ],
        "id": 1
      },
      {
        "header": "מיקום",
        "extraInfo": ["בסמח באר שבע, בניין גב ים 4."],
        "id": 2
      }
    ]
  },
  "psi": {
    "urlKey": "psi",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול פס\"י",
    "brief": "פיתוח ספקטוראלי יעודי. עוסקים בשילוב האלגוריתמים שנחקרו בצוותי המחקר בתהליכי עיבוד מתקדמים, באמצעות פיתוח תשתיות ו-low level.",
    "aboutRole": [
      {
        "text": "הספקטרום האלקטרומגנטי סובב אותנו ומשרת את האנושות בהיקפים הולכים וגדלים. החל מהטלפון הסלולרי, שהפך מכלי של אנשי עסקים לאמצעי שימוש יומיומי וכלה היום בשימוש ברשתות האינטרנט בכל מקום שהוא. כל אלו מתאפשרים בזכות שימוש בתכונות הפיזיקליות שעל הספקטרום האלקטרו מגנטי.",
        "id": 0
      },
      {
        "text": "ביחד עם הדיגיטל, יצר הספקטרום מהפכה גם בצבא. צה\"ל הופך לצבא דיגיטלי יותר וחכם יותר וכל אלה לא היו מתאפשרים מבלי לנצל את הספטקרום בצורה חכמה ויעילה. בשגרה, בחירום ובמלחמה צה\"ל צורך משאבי ספקטרום לטובת ניווט, תקשורת של אמצעי לחימה והפעלת אמצעי לחימה אלקטרונית.",
        "id": 1
      },
      {
        "text": "כדי ליצור עליונות ספקטראלית הוקמה היחידה בעילית טכנולוגית העוסקת במחקר ופיתוח של יכולות מתקדמות ופורצות דרך לחופש הפעולה של צה\"ל במימד הספקטרום.",
        "id": 2
      },
      {
        "text": "בוגרי הכשרת פס\"י, משתלבים בצוותי הפיתוח ביחידה, ועוסקים בשילוב האלגוריתמים, שנחקרו בצוותי המחקר בתהליכי עיבוד מתקדמים, זאת באמצעות פיתוח תשתיות, פיתוח בסביבת ענן, ופיתוח low-level.",
        "id": 3
      },
      {
        "text": "במסגרת ההכשרה ילמדו תכנים כגון: פיתוח קוד בשפת פיית'ון ובשפת CPP, הבנה בעולם הפיזיקלי של הספקטרום, פיתוח בענן ובניית",
        "id": 4
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": [
          "דפ\"ר 70 ומעלה.",
          "הארכת שירות ל32 חודשים לנשים (דין אישה כדין גבר).",
          "אין צורך בידע מקדים.",
          "גברים בעלי פרופיל קרבי נדרשים בהרחבת 10 יחידות לימוד מקצוע בזיכה טכנולוגית / תואר אקדמאי טכנולוגי."
        ],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": ["הכשרה שאורכה כ-19 שבועות."],
        "id": 1
      },
      {
        "header": "מיקום",
        "extraInfo": ["מחנה גדעונים."],
        "id": 2
      }
    ]
  },
  "lahavMatzovTochna": {
    "urlKey": "lahav-matzov-tochna",
    "videoUrl": "https://www.youtube.com/embed/nBwBH1gpSmc",
    "title": "מסלול לה\"ב מצו\"ב תוכנה",
    "brief": "מצו\"ב (מרכז צופן ובטחון) הינה היחידה הלאומית לפתרונות צופן והגנה בסייבר לגופים הביטחוניים השונים. ביחידה מתבצע מחקר ופיתוח מערכות ייעודיות כנגד תקיפות סייבר באוויר, ביבשה ובים.",
    "aboutRole": [
      {
        "text": "הקורס מורכב ממספר מגמות תוכנה, חומרה ו- FPGA. במגמות תלמדו את יסודות אבטחת המידע וההגנה בסייבר, תקשורת רשתות, קריפטולוגיה, פיתוח מאובטח, בדיקות חדירות ועוד. לאחר הקד\"צ תשובצו בהכשרות המשך ושירות מאתגר באחד מתחומי העיסוק.",
        "id": 0
      }
    ],
    "conditions": [
      {
        "header": "מהם תנאי הקבלה?",
        "extraInfo": [
          "דפ\"ר 70 ומעלה.",
          "מחייב נשים וגברים כאחד השלמת שירות חובה בדומה לגברים. בנוסף, נדרש חתימת קבע של שנתיים וחצי.",
          "מעבר בהצלחה של מיון אשכול מקצועות המחשב או מיון יעודי ליחידה.",
          "ביצוע סיווג בטחוני טרום הגיוס."
        ],
        "id": 0
      },
      {
        "header": "מה במסלול?",
        "extraInfo": [
          "הכשרת קד\"צ (קדם צבאית) של 12 שבועות.",
          "הכשרה של  16 שבועות בשירות החובה בנוסף להכשרת והקד\"צ."
        ],
        "id": 1
      },
      {
        "header": "מיקום",
        "extraInfo": ["בסמח באר שבע, בניין גב ים 4.", "אפשרות שיבוץ בסיום ההכשרה ביחידת מצו\"ב במחנה צריפין."],
        "id": 2
      }
    ]
  }
}
